#### Terraform Tfsec 🤖`success'
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_canonical_user_id.current: Reading...
data.aws_cloudfront_cache_policy.cache_policy_cloudfront: Reading...
aws_cloudfront_cache_policy.this-cdn-ordered-cache-policy: Refreshing state... [id=37286fbd-716b-48df-8ddd-438dd7b5af57]
aws_s3_bucket.this-s3-bucket: Refreshing state... [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket]
data.aws_cloudfront_cache_policy.cache_policy_cloudfront: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_canonical_user_id.current: Read complete after 1s [id=5a9437fb2ae7861477507b95308f7eec09cb8add867a31798428a738958bdf7d]
data.aws_s3_bucket.demo-portal-s3-bucket: Reading...
aws_s3_bucket_website_configuration.this-s3-website-configuration: Refreshing state... [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket]
aws_s3_bucket_policy.this-s3-policy: Refreshing state... [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket]
aws_s3_bucket_acl.this-s3-acl_policy: Refreshing state... [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket]
data.aws_s3_bucket.demo-portal-s3-bucket: Read complete after 1s [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_cache_policy.this-cdn-ordered-cache-policy will be updated in-place
  ~ resource "aws_cloudfront_cache_policy" "this-cdn-ordered-cache-policy" {
        id          = "37286fbd-716b-48df-8ddd-438dd7b5af57"
        name        = "caw-aws-aps1-prod-cloudfront-terraform-demo-Gzip_cache_policy_cloudfront"
        # (4 unchanged attributes hidden)

      ~ parameters_in_cache_key_and_forwarded_to_origin {
            # (2 unchanged attributes hidden)

          ~ cookies_config {
                # (1 unchanged attribute hidden)

              + cookies {}
            }

          ~ headers_config {
                # (1 unchanged attribute hidden)

              + headers {}
            }

          ~ query_strings_config {
                # (1 unchanged attribute hidden)

              + query_strings {}
            }
        }
    }

  # aws_cloudfront_distribution.this-cdn-portal will be created
  + resource "aws_cloudfront_distribution" "this-cdn-portal" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "app-name"               = "portal-cloudfront"
          + "app-role"               = "Cloudfront distribution for s3"
          + "security-accessibility" = "Public"
        }
      + tags_all                       = {
          + "app-environment"        = "Dev"
          + "app-name"               = "portal-cloudfront"
          + "app-role"               = "Cloudfront distribution for s3"
          + "info-created_by"        = "Aayush"
          + "info-purpose"           = "Development"
          + "info-terraform"         = "yes"
          + "org"                    = "CAW Studios"
          + "org-cost-center"        = "CAW Studios"
          + "org-owner"              = "aayushbajaj505@gmail.com"
          + "org-team"               = "devops"
          + "security-accessibility" = "Public"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "caw-aws-aps1-prod-s3-terraform-demo-demo-bucket.s3.amazonaws.com"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "caw-aws-aps1-prod-s3-terraform-demo-demo-bucket.s3.amazonaws.com"
          + origin_id           = "caw-aws-aps1-prod-s3-terraform-demo-demo-bucket.s3.amazonaws.com"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>

*Pusher: @AayushbajajCAW, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy infra using Terraform`*